; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_1 ?v2 - type_1 ?v5 - type_2)
 	      (pred_4 ?v1 - object ?v5 - type_2)
	      (pred_2 ?v2 - type_1 ?v6 - type_3)
	      (pred_3 ?v2 - type_1 ?v1 - object ?v6 - type_3))

   (:action op_3
       :parameters  (?v2 - type_1 ?v4 ?v3 - type_2)
       :precondition (and  (pred_1 ?v2 ?v4))
       :effect (and  (pred_1 ?v2 ?v3)
		     (not (pred_1 ?v2 ?v4))))

   (:action op_2
       :parameters (?v2 - type_1 ?v8 - object ?v7 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v7) (pred_1 ?v2 ?v7) (pred_2 ?v2 ?v6))
       :effect (and (pred_3 ?v2 ?v8 ?v6)
		    (not (pred_4 ?v8 ?v7)) 
		    (not (pred_2 ?v2 ?v6))))

   (:action op_1
       :parameters (?v2 - type_1 ?v8 - object ?v7 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_3 ?v2 ?v8 ?v6) (pred_1 ?v2 ?v7))
       :effect (and (pred_4 ?v8 ?v7)
		    (pred_2 ?v2 ?v6)
		    (not (pred_3 ?v2 ?v8 ?v6)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_13 obj_05 - type_1
obj_07 obj_03 obj_11 obj_09 - type_3
obj_08 obj_10 obj_12 obj_02 - type_2
obj_06 obj_04 obj_01 - object)
(:init
(pred_1 obj_13 obj_08)
(pred_2 obj_13 obj_07)
(pred_2 obj_13 obj_03)
(pred_1 obj_05 obj_02)
(pred_2 obj_05 obj_11)
(pred_2 obj_05 obj_09)
(pred_4 obj_06 obj_02)
(pred_4 obj_04 obj_10)
(pred_4 obj_01 obj_08)
)
(:goal
(and
(pred_4 obj_06 obj_02)
(pred_4 obj_04 obj_12)
(pred_4 obj_01 obj_10)
)
)

(:constraints
  (always (not (pred_1 obj_13 obj_12)))
)
)

; plan
1. (op_2 obj_13 obj_01 obj_08 obj_03)
   deleted: (pred_4 obj_01 obj_08) (pred_2 obj_13 obj_03)
   added: (pred_3 obj_13 obj_01 obj_03)
   goals met: 1 of 3
2. (op_3 obj_05 obj_02 obj_10)
   deleted: (pred_1 obj_05 obj_02)
   added: (pred_1 obj_05 obj_10)
   goals met: 1 of 3
3. (op_3 obj_13 obj_08 obj_10)
   deleted: (pred_1 obj_13 obj_08)
   added: (pred_1 obj_13 obj_10)
   goals met: 1 of 3
4. (op_2 obj_13 obj_04 obj_10 obj_07)
   deleted: (pred_4 obj_04 obj_10) (pred_2 obj_13 obj_07)
   added: (pred_3 obj_13 obj_04 obj_07)
   goals met: 1 of 3
5. (op_1 obj_13 obj_01 obj_10 obj_03)
   deleted: (pred_3 obj_13 obj_01 obj_03)
   added: (pred_4 obj_01 obj_10) (pred_2 obj_13 obj_03)
   goals met: 2 of 3
6. (op_1 obj_13 obj_04 obj_10 obj_07)
   deleted: (pred_3 obj_13 obj_04 obj_07)
   added: (pred_4 obj_04 obj_10) (pred_2 obj_13 obj_07)
   goals met: 2 of 3
7. (op_2 obj_05 obj_04 obj_10 obj_09)
   deleted: (pred_4 obj_04 obj_10) (pred_2 obj_05 obj_09)
   added: (pred_3 obj_05 obj_04 obj_09)
   goals met: 2 of 3
8. (op_3 obj_05 obj_10 obj_12)
   deleted: (pred_1 obj_05 obj_10)
   added: (pred_1 obj_05 obj_12)
   goals met: 2 of 3
9. (op_1 obj_05 obj_04 obj_12 obj_09)
   deleted: (pred_3 obj_05 obj_04 obj_09)
   added: (pred_4 obj_04 obj_12) (pred_2 obj_05 obj_09)
   goals met: 3 of 3
